--------------------------------------------------------------------------------------------------
       log:  C:\My Documents\ECON 20\smoke1regs.log
  log type:  text
 opened on:  28 Aug 2002, 16:22:53

. ****************************************************************************
> 
>                                  REGRESS1
> 
> ****************************************************************************
> 
> This program estimates OLS regressions of wages on smoking.  It first
> estimates alternative specifications differing by the control variables
> included.  Then models are estimated by demographic group.  In all cases,
> only full-time, full-year workers are included in the analysis;
. * Regression models are estimated for 1984 and 1991 NLSY data;
. clear;

. set maxobs 15000;
(maxvar and maxobs no longer need be set with this version of Stata)

. use smoke1;

. drop if mtreduc == . | ftreduc == . | higrad91 == . | 
>         mtrwrk == . | ftrwrk == . | urban14 == .| urban91 == . | 
>         south == .| south91 == . | numkid91 == . | numsibs == . |
>         marrd91 == . | female == .| nonwhite == . | afqt == . | 
>         age91 == . | mtrpres == . | ftrpres == . | bothpar == . | 
>         mtronly == . | ftronly == . | smkdly91 == .;
(6206 observations deleted)

. * Regressions for 1991;
. reg lnhrwg91 smkdly91 if fullyr91 == 1 [pweight=weight79], robust;
(sum of wgt is   1.1132e+07)

Regression with robust standard errors                 Number of obs =    3228
                                                       F(  1,  3226) =   69.35
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.0288
                                                       Root MSE      =  .46379

------------------------------------------------------------------------------
             |               Robust
    lnhrwg91 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    smkdly91 |  -.1756056   .0210871    -8.33   0.000    -.2169511     -.13426
       _cons |   2.444903   .0114085   214.31   0.000     2.422534    2.467272
------------------------------------------------------------------------------

. reg lnhrwg91 smkdly91 higrad91 if fullyr91 == 1 [pweight=weight79], robust;
(sum of wgt is   1.1132e+07)

Regression with robust standard errors                 Number of obs =    3228
                                                       F(  2,  3225) =  178.93
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.1414
                                                       Root MSE      =  .43614

------------------------------------------------------------------------------
             |               Robust
    lnhrwg91 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    smkdly91 |  -.0801806   .0208161    -3.85   0.000    -.1209947   -.0393664
    higrad91 |   .0701575   .0042502    16.51   0.000     .0618241     .078491
       _cons |   1.457162   .0603404    24.15   0.000     1.338853    1.575472
------------------------------------------------------------------------------

. reg lnhrwg91 smkdly91 exp91 south91 urban91 numkid91 
>               marrd91 nonwhite female higrad91 afqt if fullyr91 == 1 
>               [pweight=weight79], robust;
(sum of wgt is   1.1132e+07)

Regression with robust standard errors                 Number of obs =    3228
                                                       F( 10,  3217) =   96.28
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.2904
                                                       Root MSE      =  .39698

------------------------------------------------------------------------------
             |               Robust
    lnhrwg91 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    smkdly91 |  -.0656032   .0192176    -3.41   0.001    -.1032831   -.0279232
       exp91 |    .029147   .0031958     9.12   0.000     .0228809    .0354131
     south91 |  -.0371477   .0181426    -2.05   0.041    -.0727199   -.0015755
     urban91 |   .1420381   .0219853     6.46   0.000     .0989316    .1851447
    numkid91 |  -.0156352   .0081857    -1.91   0.056    -.0316849    .0004144
     marrd91 |   .0862373   .0185686     4.64   0.000     .0498299    .1226448
    nonwhite |   .0041432    .020778     0.20   0.842    -.0365962    .0448826
      female |    -.18471   .0170231   -10.85   0.000    -.2180872   -.1513328
    higrad91 |   .0482036   .0049724     9.69   0.000     .0384542     .057953
        afqt |   .0050341   .0005632     8.94   0.000     .0039299    .0061383
       _cons |   .9970603    .071349    13.97   0.000     .8571662    1.136954
------------------------------------------------------------------------------

. reg lnhrwg91 smkdly91 exp91 south91 urban91 numkid91 
>               marrd91 nonwhite female higrad91 afqt urban14 south 
>               mtreduc ftreduc mtrwrk14 ftrwrk14 numsibs bothpar mtronly 
>               if fullyr91 == 1 [pweight=weight79], robust;
(sum of wgt is   1.1132e+07)

Regression with robust standard errors                 Number of obs =    3228
                                                       F( 19,  3208) =   52.61
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.2951
                                                       Root MSE      =  .39623

------------------------------------------------------------------------------
             |               Robust
    lnhrwg91 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    smkdly91 |  -.0693372   .0193796    -3.58   0.000    -.1073347   -.0313396
       exp91 |   .0288421   .0032012     9.01   0.000     .0225654    .0351187
     south91 |   .0032189   .0313105     0.10   0.918    -.0581718    .0646096
     urban91 |   .1316548   .0226592     5.81   0.000     .0872267    .1760828
    numkid91 |  -.0140118   .0082771    -1.69   0.091    -.0302408    .0022173
     marrd91 |   .0873425   .0185023     4.72   0.000      .051065    .1236201
    nonwhite |   .0213928   .0221348     0.97   0.334     -.022007    .0647926
      female |  -.1818934   .0170598   -10.66   0.000    -.2153427   -.1484441
    higrad91 |   .0454071   .0050931     8.92   0.000     .0354212    .0553931
        afqt |   .0046207   .0005815     7.95   0.000     .0034805    .0057609
     urban14 |   .0292937   .0208446     1.41   0.160    -.0115764    .0701638
       south |  -.0443206   .0312639    -1.42   0.156    -.1056199    .0169787
     mtreduc |   .0047324   .0036392     1.30   0.194    -.0024031    .0118678
     ftreduc |   .0019585   .0030381     0.64   0.519    -.0039983    .0079152
    mtrwrk14 |  -.0216408   .0172413    -1.26   0.210    -.0554459    .0121643
    ftrwrk14 |   .0402138   .0424561     0.95   0.344    -.0430301    .1234576
     numsibs |  -.0048411   .0039349    -1.23   0.219    -.0125562    .0028741
     bothpar |  -.0080975   .0696354    -0.12   0.907    -.1446319    .1284369
     mtronly |   .0269782   .0699605     0.39   0.700    -.1101935      .16415
       _cons |   .9722082   .0895067    10.86   0.000     .7967121    1.147704
------------------------------------------------------------------------------

. reg lnhrwg91 smkdly91 exp91 south91 urban91 numkid91 
>               marrd91 nonwhite female higrad91 afqt urban14 south 
>               mtreduc ftreduc mtrwrk14 ftrwrk14 numsibs bothpar mtronly 
>         profocc saleocc clerocc craftocc operocc tranocc labocc
>         farmocc servocc prhhocc if fullyr91 == 1 [pweight=weight79], robust;
(sum of wgt is   1.1132e+07)

Regression with robust standard errors                 Number of obs =    3228
                                                       F( 29,  3198) =   41.45
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.3256
                                                       Root MSE      =  .38818

------------------------------------------------------------------------------
             |               Robust
    lnhrwg91 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    smkdly91 |  -.0667217   .0189295    -3.52   0.000    -.1038368   -.0296067
       exp91 |   .0273857   .0031435     8.71   0.000     .0212223    .0335491
     south91 |   .0001041   .0302339     0.00   0.997    -.0591757    .0593839
     urban91 |   .1248808   .0222012     5.62   0.000     .0813507    .1684109
    numkid91 |  -.0079143   .0080842    -0.98   0.328    -.0237651    .0079366
     marrd91 |   .0786259   .0180847     4.35   0.000     .0431672    .1140846
    nonwhite |   .0337112   .0222858     1.51   0.130    -.0099847    .0774071
      female |  -.1779636   .0188196    -9.46   0.000    -.2148633    -.141064
    higrad91 |   .0361023   .0054155     6.67   0.000     .0254841    .0467206
        afqt |   .0040318   .0005898     6.84   0.000     .0028755    .0051882
     urban14 |   .0186947   .0203284     0.92   0.358    -.0211633    .0585527
       south |  -.0536515   .0301809    -1.78   0.076    -.1128273    .0055243
     mtreduc |   .0049467   .0035591     1.39   0.165    -.0020316     .011925
     ftreduc |   .0009009   .0029609     0.30   0.761    -.0049046    .0067064
    mtrwrk14 |  -.0193051   .0168584    -1.15   0.252    -.0523595    .0137493
    ftrwrk14 |   .0360805   .0416959     0.87   0.387     -.045673    .1178339
     numsibs |  -.0049065   .0038687    -1.27   0.205    -.0124918    .0026789
     bothpar |   .0083668   .0698538     0.12   0.905    -.1285959    .1453295
     mtronly |   .0211242   .0694745     0.30   0.761    -.1150947    .1573432
     profocc |   .0079586   .0276599     0.29   0.774    -.0462744    .0621916
     saleocc |   .0034183   .0435438     0.08   0.937    -.0819583    .0887949
     clerocc |  -.1219976   .0287508    -4.24   0.000    -.1783695   -.0656257
    craftocc |  -.0437377   .0342983    -1.28   0.202    -.1109866    .0235113
     operocc |   -.087427   .0385532    -2.27   0.023    -.1630184   -.0118356
     tranocc |  -.1994435   .0481414    -4.14   0.000    -.2938346   -.1050524
      labocc |  -.2279824   .0452798    -5.03   0.000    -.3167628    -.139202
     farmocc |  -.4965727   .1048075    -4.74   0.000    -.7020695    -.291076
     servocc |  -.1772148   .0345763    -5.13   0.000    -.2450087   -.1094209
     prhhocc |  -.6928353   .1016629    -6.82   0.000    -.8921664   -.4935041
       _cons |    1.23666    .105328    11.74   0.000     1.030143    1.443177
------------------------------------------------------------------------------

. areg lnhrwg91 smkdly91 exp91 south91 urban91 numkid91 
>                marrd91 nonwhite female higrad91 afqt urban14 south 
>                mtreduc ftreduc mtrwrk14 ftrwrk14 numsibs bothpar mtronly 
>         profocc saleocc clerocc craftocc operocc tranocc labocc
>         farmocc servocc prhhocc if fullyr91 == 1 [pweight=weight79], 
>         absorb(state91) robust;

Regression with robust standard errors                 Number of obs =    3228
                                                       F( 28,  3149) =   38.77
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.3648
                                                       Adj R-squared =  0.3491
                                                       Root MSE      =  .37962

------------------------------------------------------------------------------
             |               Robust
    lnhrwg91 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    smkdly91 |  -.0687468    .018447    -3.73   0.000    -.1049161   -.0325774
       exp91 |   .0262922   .0031172     8.43   0.000     .0201802    .0324042
     south91 |  (dropped)
     urban91 |   .1089016   .0236661     4.60   0.000      .062499    .1553042
    numkid91 |  -.0033781   .0080365    -0.42   0.674    -.0191354    .0123793
     marrd91 |   .0800806   .0178017     4.50   0.000     .0451764    .1149847
    nonwhite |   .0054562   .0233807     0.23   0.815    -.0403866    .0512991
      female |  -.1725849   .0186293    -9.26   0.000    -.2091116   -.1360581
    higrad91 |   .0346692   .0053553     6.47   0.000     .0241691    .0451694
        afqt |   .0042899   .0005897     7.28   0.000     .0031337     .005446
     urban14 |   .0122477   .0206638     0.59   0.553    -.0282682    .0527635
       south |  -.0460966   .0309997    -1.49   0.137    -.1068782    .0146851
     mtreduc |   .0060155   .0035816     1.68   0.093     -.001007     .013038
     ftreduc |    -.00031   .0029223    -0.11   0.916    -.0060397    .0054198
    mtrwrk14 |  -.0112998   .0165655    -0.68   0.495      -.04378    .0211805
    ftrwrk14 |   .0483404   .0421051     1.15   0.251    -.0342159    .1308967
     numsibs |  -.0022817   .0038615    -0.59   0.555    -.0098529    .0052896
     bothpar |  -.0105368   .0674392    -0.16   0.876     -.142766    .1216925
     mtronly |   .0057398   .0687998     0.08   0.934    -.1291572    .1406367
     profocc |   .0084021   .0272991     0.31   0.758    -.0451236    .0619279
     saleocc |   .0085989   .0434939     0.20   0.843    -.0766803    .0938781
     clerocc |  -.1161203   .0279078    -4.16   0.000    -.1708396   -.0614011
    craftocc |  -.0281827   .0336015    -0.84   0.402    -.0940658    .0377003
     operocc |  -.0629896   .0381093    -1.65   0.098    -.1377112    .0117319
     tranocc |  -.1805414   .0467472    -3.86   0.000    -.2721995   -.0888833
      labocc |   -.202792   .0438378    -4.63   0.000    -.2887456   -.1168384
     farmocc |  -.5025395   .1021534    -4.92   0.000    -.7028335   -.3022455
     servocc |  -.1661273   .0335061    -4.96   0.000    -.2318232   -.1004313
     prhhocc |  -.6890417   .1187264    -5.80   0.000    -.9218306   -.4562528
       _cons |    1.24941    .103861    12.03   0.000     1.045768    1.453052
-------------+----------------------------------------------------------------
     state91 |   absorbed                                      (51 categories)

. * examine whether the number of years smoked affects your wages;
. gen yrssmok = age91 - agesmk92;
(3466 missing values generated)

. gen smkagint = yrssmok*smkdly91;
(3466 missing values generated)

. reg lnhrwg91 smkdly91 smkagint exp91 south91 urban91 numkid91 marrd91
>         nonwhite female higrad91 afqt urban14 south mtreduc ftreduc mtrwrk14
>         ftrwrk14 numsibs bothpar mtronly if fullyr91 == 1 
>         [pweight=weight79], robust;
(sum of wgt is   4.9019e+06)

Regression with robust standard errors                 Number of obs =    1354
                                                       F( 20,  1333) =   21.73
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.2925
                                                       Root MSE      =  .39496

------------------------------------------------------------------------------
             |               Robust
    lnhrwg91 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    smkdly91 |  -.0292803   .0581564    -0.50   0.615    -.1433682    .0848077
    smkagint |  -.0051938   .0039028    -1.33   0.183    -.0128502    .0024625
       exp91 |   .0400992   .0048543     8.26   0.000     .0305763    .0496221
     south91 |  -.0133613   .0480019    -0.28   0.781    -.1075288    .0808061
     urban91 |   .1282488   .0336097     3.82   0.000     .0623152    .1941824
    numkid91 |   .0004227   .0127713     0.03   0.974    -.0246314    .0254767
     marrd91 |   .0691153   .0282272     2.45   0.014     .0137407    .1244899
    nonwhite |   .0347059   .0347224     1.00   0.318    -.0334106    .1028224
      female |  -.1486105   .0260014    -5.72   0.000    -.1996187   -.0976024
    higrad91 |   .0487865   .0079791     6.11   0.000     .0331335    .0644395
        afqt |   .0038477   .0008479     4.54   0.000     .0021843    .0055112
     urban14 |   .0337522   .0328809     1.03   0.305    -.0307517    .0982561
       south |  -.0155385   .0469605    -0.33   0.741     -.107663     .076586
     mtreduc |   .0073598   .0055082     1.34   0.182    -.0034458    .0181655
     ftreduc |  -.0016196   .0047605    -0.34   0.734    -.0109584    .0077193
    mtrwrk14 |   .0048507    .025969     0.19   0.852    -.0460939    .0557952
    ftrwrk14 |   .0802167   .0544481     1.47   0.141    -.0265966      .18703
     numsibs |  -.0041145   .0059249    -0.69   0.488    -.0157376    .0075086
     bothpar |  -.0952453   .0925562    -1.03   0.304     -.276817    .0863264
     mtronly |  -.1030729   .0976578    -1.06   0.291    -.2946527    .0885068
       _cons |   .9114558   .1294664     7.04   0.000     .6574758    1.165436
------------------------------------------------------------------------------

. * examine the effects of different levels of smoking on wages;
. reg lnhrwg91 smkdly91 amtsmk exp91 south91 urban91 
>               numkid91 marrd91 nonwhite female higrad91 afqt urban14 
>               south mtreduc ftreduc mtrwrk14 ftrwrk14 numsibs 
>               bothpar mtronly if fullyr91 == 1 [pweight=weight79], robust;
(sum of wgt is   1.1132e+07)

Regression with robust standard errors                 Number of obs =    3228
                                                       F( 20,  3207) =   50.36
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.2958
                                                       Root MSE      =  .39608

------------------------------------------------------------------------------
             |               Robust
    lnhrwg91 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    smkdly91 |  -.0364652   .0259549    -1.40   0.160    -.0873551    .0144246
      amtsmk |  -.0020812    .001232    -1.69   0.091    -.0044968    .0003344
       exp91 |   .0289027   .0031943     9.05   0.000     .0226395    .0351658
     south91 |   .0042502   .0312556     0.14   0.892    -.0570327    .0655332
     urban91 |   .1311566   .0226682     5.79   0.000     .0867111    .1756022
    numkid91 |  -.0133826   .0083199    -1.61   0.108    -.0296954    .0029302
     marrd91 |   .0859672   .0185154     4.64   0.000      .049664    .1222705
    nonwhite |   .0171035   .0222272     0.77   0.442    -.0264775    .0606845
      female |   -.183936   .0170924   -10.76   0.000    -.2174492   -.1504228
    higrad91 |   .0449021   .0051033     8.80   0.000     .0348961    .0549081
        afqt |   .0046331   .0005815     7.97   0.000      .003493    .0057733
     urban14 |   .0280343   .0208086     1.35   0.178    -.0127652    .0688338
       south |  -.0440904    .031183    -1.41   0.157     -.105231    .0170502
     mtreduc |   .0049224   .0036422     1.35   0.177    -.0022189    .0120637
     ftreduc |   .0020155   .0030404     0.66   0.507    -.0039458    .0079767
    mtrwrk14 |  -.0219536   .0172308    -1.27   0.203    -.0557381    .0118309
    ftrwrk14 |    .042816    .042483     1.01   0.314    -.0404806    .1261127
     numsibs |  -.0047614    .003928    -1.21   0.226    -.0124629    .0029402
     bothpar |  -.0141985   .0697912    -0.20   0.839    -.1510384    .1226414
     mtronly |   .0241572   .0700458     0.34   0.730    -.1131819    .1614963
       _cons |   .9809693   .0897285    10.93   0.000     .8050382      1.1569
------------------------------------------------------------------------------

. * examine whether including tenure on the job along with experience
>   significantly alters the results;
. reg lnhrwg91 smkdly91 exp91 tenure91 south91 urban91 numkid91 marrd91
>         nonwhite female higrad91 afqt urban14 south mtreduc ftreduc mtrwrk14
>         ftrwrk14 numsibs bothpar mtronly if fullyr91 == 1 
>         [pweight=weight79], robust;
(sum of wgt is   1.0939e+07)

Regression with robust standard errors                 Number of obs =    3167
                                                       F( 20,  3146) =   56.89
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.3230
                                                       Root MSE      =  .38762

------------------------------------------------------------------------------
             |               Robust
    lnhrwg91 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    smkdly91 |  -.0664379   .0189982    -3.50   0.000    -.1036881   -.0291877
       exp91 |   .0157544   .0034806     4.53   0.000       .00893    .0225789
    tenure91 |   .0245665   .0025212     9.74   0.000     .0196232    .0295098
     south91 |   .0087575   .0299161     0.29   0.770    -.0498995    .0674146
     urban91 |   .1408855   .0222912     6.32   0.000     .0971787    .1845923
    numkid91 |  -.0133799   .0082627    -1.62   0.105    -.0295808     .002821
     marrd91 |   .0766563    .018317     4.18   0.000     .0407418    .1125707
    nonwhite |   .0033712   .0221679     0.15   0.879    -.0400937    .0468361
      female |  -.1822187   .0168308   -10.83   0.000    -.2152192   -.1492182
    higrad91 |   .0491531   .0049793     9.87   0.000     .0393902     .058916
        afqt |     .00423   .0005764     7.34   0.000     .0030998    .0053601
     urban14 |   .0232717   .0206371     1.13   0.260    -.0171918    .0637352
       south |  -.0492482   .0300519    -1.64   0.101    -.1081715    .0096751
     mtreduc |   .0063437   .0035903     1.77   0.077     -.000696    .0133833
     ftreduc |   .0021047   .0029603     0.71   0.477    -.0036997    .0079091
    mtrwrk14 |  -.0151658   .0170272    -0.89   0.373    -.0485514    .0182198
    ftrwrk14 |   .0445458   .0414817     1.07   0.283    -.0367881    .1258797
     numsibs |  -.0039741   .0038881    -1.02   0.307    -.0115975    .0036494
     bothpar |  -.0674979   .0669733    -1.01   0.314    -.1988136    .0638178
     mtronly |  -.0284743   .0690531    -0.41   0.680     -.163868    .1069193
       _cons |   1.011456   .0879559    11.50   0.000      .838999    1.183913
------------------------------------------------------------------------------

. * examine whether the returns to experience is affected by whether or not
>   you smoke.  If smokers have a higher rate of time preference, then we
>   should expect the interaction term to be negative;
. gen smokexp = smkdly91*exp91;

. reg lnhrwg91 smkdly91 exp91 smokexp south91 urban91 numkid91 marrd91
>         nonwhite female higrad91 afqt urban14 south mtreduc ftreduc mtrwrk14
>         ftrwrk14 numsibs bothpar mtronly if fullyr91 == 1 
>         [pweight=weight79], robust;
(sum of wgt is   1.1132e+07)

Regression with robust standard errors                 Number of obs =    3228
                                                       F( 20,  3207) =   50.59
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.2958
                                                       Root MSE      =   .3961

------------------------------------------------------------------------------
             |               Robust
    lnhrwg91 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    smkdly91 |  -.1788366   .0703724    -2.54   0.011    -.3168161   -.0408571
       exp91 |   .0257541   .0038708     6.65   0.000     .0181646    .0333436
     smokexp |    .010031   .0064103     1.56   0.118    -.0025377    .0225996
     south91 |   .0029625   .0313756     0.09   0.925    -.0585558    .0644809
     urban91 |   .1313151   .0226752     5.79   0.000     .0868557    .1757744
    numkid91 |  -.0134346   .0082644    -1.63   0.104    -.0296387    .0027695
     marrd91 |   .0865702   .0184946     4.68   0.000     .0503077    .1228326
    nonwhite |   .0206797   .0221138     0.94   0.350    -.0226789    .0640383
      female |  -.1808987   .0171013   -10.58   0.000    -.2144292   -.1473682
    higrad91 |    .044623   .0051022     8.75   0.000     .0346192    .0546269
        afqt |   .0046527   .0005819     8.00   0.000     .0035118    .0057937
     urban14 |   .0299956   .0208465     1.44   0.150    -.0108783    .0708695
       south |   -.045722   .0313466    -1.46   0.145    -.1071834    .0157394
     mtreduc |   .0045671   .0036379     1.26   0.209    -.0025658       .0117
     ftreduc |   .0021033   .0030356     0.69   0.488    -.0038486    .0080551
    mtrwrk14 |  -.0217539   .0172392    -1.26   0.207    -.0555548     .012047
    ftrwrk14 |   .0387908   .0421007     0.92   0.357    -.0437563    .1213378
     numsibs |  -.0047713   .0039341    -1.21   0.225     -.012485    .0029423
     bothpar |  -.0087505   .0695575    -0.13   0.900    -.1451321    .1276312
     mtronly |   .0255902   .0699412     0.37   0.714    -.1115438    .1627241
       _cons |   1.016302   .0939854    10.81   0.000     .8320248     1.20058
------------------------------------------------------------------------------

. * repeat the analysis for 1984;
. clear;

. set maxobs 15000;
(maxvar and maxobs no longer need be set with this version of Stata)

. use smoke1;

. drop if mtreduc == . | ftreduc == . | higrad84 == . | 
>         mtrwrk == . | ftrwrk == . | urban14 == .| urban84 == . | 
>         south == .| south84 == . | numkid84 == . | numsibs == . |
>         marrd84 == . | female == .| nonwhite == . | afqt == . | 
>         age84 == . | mtrpres == . | ftrpres == . | bothpar == . | 
>         mtronly == . | ftronly == . | smkdly84 == .;
(4018 observations deleted)

. * Regressions for 1984;
. reg lnhrwg84 smkdly84 if fullyr84 == 1 [pweight=weight79], robust;
(sum of wgt is   9.1926e+06)

Regression with robust standard errors                 Number of obs =    2817
                                                       F(  1,  2815) =   34.06
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.0171
                                                       Root MSE      =  .41836

------------------------------------------------------------------------------
             |               Robust
    lnhrwg84 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    smkdly84 |  -.1138558   .0195095    -5.84   0.000    -.1521101   -.0756015
       _cons |   2.189858   .0122564   178.67   0.000     2.165826    2.213891
------------------------------------------------------------------------------

. reg lnhrwg84 smkdly84 higrad84 if fullyr84 == 1 [pweight=weight79], robust;
(sum of wgt is   9.1926e+06)

Regression with robust standard errors                 Number of obs =    2817
                                                       F(  2,  2814) =   96.60
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.0868
                                                       Root MSE      =  .40332

------------------------------------------------------------------------------
             |               Robust
    lnhrwg84 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    smkdly84 |  -.0615823    .019459    -3.16   0.002    -.0997377    -.023427
    higrad84 |   .0603938   .0049022    12.32   0.000     .0507815    .0700061
       _cons |   1.384708    .066616    20.79   0.000     1.254086    1.515329
------------------------------------------------------------------------------

. reg lnhrwg84 smkdly84 exp84 south84 urban84 numkid84 
>               marrd84 nonwhite female higrad84 afqt if fullyr84 == 1 
>               [pweight=weight79], robust;
(sum of wgt is   9.1926e+06)

Regression with robust standard errors                 Number of obs =    2817
                                                       F( 10,  2806) =   66.66
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.2521
                                                       Root MSE      =  .36553

------------------------------------------------------------------------------
             |               Robust
    lnhrwg84 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    smkdly84 |  -.0438307   .0177321    -2.47   0.014    -.0785999   -.0090614
       exp84 |   .0536492   .0048547    11.05   0.000       .04413    .0631683
     south84 |  -.0351145   .0180289    -1.95   0.052    -.0704657    .0002367
     urban84 |   .1200467   .0204623     5.87   0.000      .079924    .1601693
    numkid84 |   .0022211    .013563     0.16   0.870    -.0243733    .0288156
     marrd84 |   .0733728    .018919     3.88   0.000     .0362762    .1104693
    nonwhite |   .0257979   .0236163     1.09   0.275    -.0205092     .072105
      female |  -.1684853   .0166852   -10.10   0.000    -.2012019   -.1357688
    higrad84 |    .044495   .0056911     7.82   0.000     .0333359    .0556541
        afqt |   .0039603   .0006138     6.45   0.000     .0027568    .0051639
       _cons |   .9795213   .0682556    14.35   0.000      .845685    1.113358
------------------------------------------------------------------------------

. reg lnhrwg84 smkdly84 exp84 south84 urban84 numkid84 
>               marrd84 nonwhite female higrad84 afqt urban14 south 
>               mtreduc ftreduc mtrwrk14 ftrwrk14 numsibs bothpar mtronly 
>               if fullyr84 == 1 [pweight=weight79], robust;
(sum of wgt is   9.1926e+06)

Regression with robust standard errors                 Number of obs =    2817
                                                       F( 19,  2797) =   37.45
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.2586
                                                       Root MSE      =   .3645

------------------------------------------------------------------------------
             |               Robust
    lnhrwg84 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    smkdly84 |  -.0415595   .0176716    -2.35   0.019    -.0762102   -.0069088
       exp84 |   .0523925   .0048623    10.78   0.000     .0428584    .0619266
     south84 |  -.0346809      .0373    -0.93   0.353    -.1078193    .0384575
     urban84 |   .1175272   .0213059     5.52   0.000     .0757502    .1593041
    numkid84 |   .0016134   .0134979     0.12   0.905    -.0248534    .0280803
     marrd84 |   .0728852   .0189379     3.85   0.000     .0357516    .1100188
    nonwhite |   .0309512   .0247226     1.25   0.211    -.0175252    .0794276
      female |  -.1699587   .0165672   -10.26   0.000    -.2024439   -.1374735
    higrad84 |   .0448373   .0058139     7.71   0.000     .0334374    .0562372
        afqt |   .0039658   .0006205     6.39   0.000     .0027491    .0051826
     urban14 |   .0283847   .0208713     1.36   0.174      -.01254    .0693094
       south |   .0092808   .0384148     0.24   0.809    -.0660434     .084605
     mtreduc |   .0020832   .0039539     0.53   0.598    -.0056697    .0098361
     ftreduc |  -.0026895   .0032381    -0.83   0.406    -.0090388    .0036598
    mtrwrk14 |  -.0462368   .0174124    -2.66   0.008    -.0803792   -.0120945
    ftrwrk14 |   .0052827   .0423371     0.12   0.901    -.0777324    .0882979
     numsibs |   .0050641    .004215     1.20   0.230    -.0032009     .013329
     bothpar |   .1115714   .0751206     1.49   0.138     -.035726    .2588688
     mtronly |   .0463128   .0724337     0.64   0.523     -.095716    .1883417
       _cons |   .8646336    .088131     9.81   0.000     .6918252    1.037442
------------------------------------------------------------------------------

. reg lnhrwg84 smkdly84 exp84 south84 urban84 numkid84 
>               marrd84 nonwhite female higrad84 afqt urban14 south 
>               mtreduc ftreduc mtrwrk14 ftrwrk14 numsibs bothpar mtronly 
>         profocc saleocc clerocc craftocc operocc tranocc labocc
>         farmocc servocc prhhocc if fullyr84 == 1 [pweight=weight79], robust;
(sum of wgt is   9.1926e+06)

Regression with robust standard errors                 Number of obs =    2817
                                                       F( 29,  2787) =   27.38
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.2772
                                                       Root MSE      =  .36054

------------------------------------------------------------------------------
             |               Robust
    lnhrwg84 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    smkdly84 |  -.0424592   .0175682    -2.42   0.016    -.0769071   -.0080113
       exp84 |   .0529245   .0048044    11.02   0.000      .043504     .062345
     south84 |  -.0494415   .0372175    -1.33   0.184    -.1224181    .0235351
     urban84 |   .1185276   .0212338     5.58   0.000      .076892    .1601632
    numkid84 |   .0026846   .0134148     0.20   0.841    -.0236194    .0289886
     marrd84 |   .0710347   .0186515     3.81   0.000     .0344626    .1076068
    nonwhite |   .0411473   .0246634     1.67   0.095     -.007213    .0895077
      female |  -.1461677   .0186087    -7.85   0.000    -.1826559   -.1096795
    higrad84 |   .0422936   .0059001     7.17   0.000     .0307246    .0538625
        afqt |   .0038431   .0006193     6.21   0.000     .0026288    .0050574
     urban14 |   .0330211   .0210154     1.57   0.116    -.0081862    .0742283
       south |   .0228406   .0383647     0.60   0.552    -.0523855    .0980668
     mtreduc |   .0029369   .0039621     0.74   0.459    -.0048319    .0107058
     ftreduc |  -.0019555   .0031804    -0.61   0.539    -.0081916    .0042806
    mtrwrk14 |   -.042771   .0172357    -2.48   0.013     -.076567    -.008975
    ftrwrk14 |   .0050513   .0406551     0.12   0.901    -.0746658    .0847684
     numsibs |   .0052073   .0041333     1.26   0.208    -.0028973     .013312
     bothpar |   .0966852   .0730068     1.32   0.186    -.0464677    .2398381
     mtronly |   .0406629   .0724634     0.56   0.575    -.1014245    .1827502
     profocc |   .0194383   .0262851     0.74   0.460    -.0321019    .0709784
     saleocc |  -.1040019   .0385978    -2.69   0.007     -.179685   -.0283188
     clerocc |  -.1064763    .024528    -4.34   0.000    -.1545712   -.0583813
    craftocc |   .0324647    .033378     0.97   0.331    -.0329834    .0979128
     operocc |   .0384692   .0355127     1.08   0.279    -.0311648    .1081031
     tranocc |  -.0372975   .0563546    -0.66   0.508    -.1477985    .0732035
      labocc |  -.0549926   .0425434    -1.29   0.196    -.1384124    .0284272
     farmocc |   -.216734   .0482793    -4.49   0.000    -.3114007   -.1220673
     servocc |  -.1197026   .0336661    -3.56   0.000    -.1857157   -.0536895
     prhhocc |  -.0128009   .1181667    -0.11   0.914    -.2445041    .2189023
       _cons |    .910473   .0932446     9.76   0.000     .7276376    1.093308
------------------------------------------------------------------------------

. areg lnhrwg84 smkdly84 exp84 south84 urban84 numkid84 
>                marrd84 nonwhite female higrad84 afqt urban14 south 
>                mtreduc ftreduc mtrwrk14 ftrwrk14 numsibs bothpar mtronly 
>         profocc saleocc clerocc craftocc operocc tranocc labocc
>         farmocc servocc prhhocc if fullyr84 == 1 [pweight=weight79], 
>          absorb(state84) robust;

Regression with robust standard errors                 Number of obs =    2817
                                                       F( 29,  2740) =   23.55
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.2997
                                                       Adj R-squared =  0.2803
                                                       Root MSE      =  .35793

------------------------------------------------------------------------------
             |               Robust
    lnhrwg84 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    smkdly84 |  -.0449877   .0178372    -2.52   0.012    -.0799635    -.010012
       exp84 |   .0512691   .0048143    10.65   0.000      .041829    .0607092
     south84 |   -.041681   .1274057    -0.33   0.744    -.2915019    .2081399
     urban84 |   .1053189   .0236219     4.46   0.000     .0590004    .1516375
    numkid84 |   .0045295   .0136491     0.33   0.740    -.0222341     .031293
     marrd84 |   .0786234   .0188843     4.16   0.000     .0415944    .1156524
    nonwhite |   .0303243   .0249294     1.22   0.224     -.018558    .0792067
      female |  -.1411707   .0188934    -7.47   0.000    -.1782175    -.104124
    higrad84 |    .041669   .0059774     6.97   0.000     .0299484    .0533897
        afqt |   .0038157   .0006248     6.11   0.000     .0025907    .0050408
     urban14 |   .0259333   .0218519     1.19   0.235    -.0169146    .0687812
       south |   .0038707   .0396261     0.10   0.922    -.0738293    .0815707
     mtreduc |   .0042732   .0040078     1.07   0.286    -.0035854    .0121318
     ftreduc |  -.0023396    .003193    -0.73   0.464    -.0086005    .0039214
    mtrwrk14 |  -.0409674   .0174023    -2.35   0.019    -.0750904   -.0068444
    ftrwrk14 |    .013145   .0395969     0.33   0.740    -.0644977    .0907878
     numsibs |   .0065569   .0041557     1.58   0.115    -.0015918    .0147056
     bothpar |   .0704011    .073282     0.96   0.337    -.0732924    .2140946
     mtronly |   .0164814   .0708958     0.23   0.816    -.1225333    .1554961
     profocc |   .0210163     .02632     0.80   0.425    -.0305928    .0726253
     saleocc |  -.1000575   .0383685    -2.61   0.009    -.1752916   -.0248234
     clerocc |  -.1019554   .0250973    -4.06   0.000    -.1511669   -.0527438
    craftocc |   .0432014    .034024     1.27   0.204    -.0235139    .1099166
     operocc |   .0501072   .0351268     1.43   0.154    -.0187705     .118985
     tranocc |  -.0310642   .0556056    -0.56   0.576    -.1400974     .077969
      labocc |  -.0385755   .0431742    -0.89   0.372    -.1232328    .0460817
     farmocc |  -.2276015   .0493824    -4.61   0.000    -.3244321   -.1307709
     servocc |   -.123262   .0337006    -3.66   0.000    -.1893432   -.0571807
     prhhocc |   .0000652    .101575     0.00   0.999    -.1991062    .1992365
       _cons |   .9434012   .1037216     9.10   0.000     .7400209    1.146782
-------------+----------------------------------------------------------------
     state84 |   absorbed                                      (48 categories)

. * examine whether the number of years smoked affects your wages;
. gen yrssmok = age84 - agesmk92;
(5803 missing values generated)

. gen smkagint = yrssmok*smkdly84;
(5803 missing values generated)

. reg lnhrwg84 smkdly84 smkagint exp84 south84 urban84 numkid84 marrd84
>         nonwhite female higrad84 afqt urban14 south mtreduc ftreduc mtrwrk14
>         ftrwrk14 numsibs bothpar mtronly if fullyr84 == 1 
>         [pweight=weight79], robust;
(sum of wgt is   3.7783e+06)

Regression with robust standard errors                 Number of obs =     999
                                                       F( 20,   978) =   13.92
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.2521
                                                       Root MSE      =  .35021

------------------------------------------------------------------------------
             |               Robust
    lnhrwg84 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    smkdly84 |   .0018894   .0471145     0.04   0.968    -.0905678    .0943465
    smkagint |  -.0009444   .0056267    -0.17   0.867    -.0119861    .0100973
       exp84 |   .0639908   .0079634     8.04   0.000     .0483636     .079618
     south84 |   .0065362   .0501889     0.13   0.896    -.0919541    .1050266
     urban84 |   .0745775   .0370205     2.01   0.044     .0019286    .1472263
    numkid84 |  -.0029314   .0190047    -0.15   0.877     -.040226    .0343633
     marrd84 |   .0696207   .0289513     2.40   0.016     .0128068    .1264345
    nonwhite |   .0049923   .0391713     0.13   0.899    -.0718772    .0818617
      female |   -.135622   .0260825    -5.20   0.000     -.186806   -.0844379
    higrad84 |   .0438496   .0096766     4.53   0.000     .0248604    .0628388
        afqt |   .0034592   .0009227     3.75   0.000     .0016486    .0052698
     urban14 |    .032928   .0319758     1.03   0.303    -.0298211    .0956772
       south |  -.0409882     .05295    -0.77   0.439     -.144897    .0629206
     mtreduc |  -.0012502   .0065386    -0.19   0.848    -.0140814     .011581
     ftreduc |  -.0040263   .0059052    -0.68   0.496    -.0156145     .007562
    mtrwrk14 |  -.0649891   .0264044    -2.46   0.014    -.1168049   -.0131733
    ftrwrk14 |  -.0815746   .0797721    -1.02   0.307    -.2381186    .0749695
     numsibs |   .0052611   .0067502     0.78   0.436    -.0079855    .0185077
     bothpar |   .0716508    .135599     0.53   0.597    -.1944477    .3377493
     mtronly |   -.125021   .1145931    -1.09   0.276    -.3498976    .0998556
       _cons |   1.030457   .1369371     7.53   0.000     .7617332    1.299182
------------------------------------------------------------------------------

. * examine the effects of different levels of smoking on wages;
. reg lnhrwg84 smkdly84 amtsmk exp84 south84 urban84 
>               numkid84 marrd84 nonwhite female higrad84 afqt urban14 
>               south mtreduc ftreduc mtrwrk14 ftrwrk14 numsibs 
>               bothpar mtronly if fullyr84 == 1 [pweight=weight79], robust;
(sum of wgt is   9.1926e+06)

Regression with robust standard errors                 Number of obs =    2817
                                                       F( 20,  2796) =   35.50
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.2589
                                                       Root MSE      =  .36451

------------------------------------------------------------------------------
             |               Robust
    lnhrwg84 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    smkdly84 |  -.0335352   .0200647    -1.67   0.095    -.0728783    .0058078
      amtsmk |   -.000792   .0010919    -0.73   0.468    -.0029331     .001349
       exp84 |    .052375   .0048643    10.77   0.000      .042837     .061913
     south84 |  -.0343158   .0373019    -0.92   0.358    -.1074578    .0388261
     urban84 |   .1174031   .0213172     5.51   0.000     .0756041    .1592021
    numkid84 |   .0019384    .013566     0.14   0.886    -.0246619    .0285387
     marrd84 |   .0727201   .0189369     3.84   0.000     .0355883    .1098519
    nonwhite |   .0300023   .0247542     1.21   0.226     -.018536    .0785406
      female |  -.1714012   .0166299   -10.31   0.000    -.2040093   -.1387931
    higrad84 |   .0445842   .0058065     7.68   0.000     .0331988    .0559696
        afqt |   .0039637   .0006206     6.39   0.000     .0027468    .0051806
     urban14 |   .0279808   .0208884     1.34   0.181    -.0129775     .068939
       south |   .0091835    .038418     0.24   0.811    -.0661469     .084514
     mtreduc |   .0022094   .0039583     0.56   0.577     -.005552    .0099708
     ftreduc |  -.0027185   .0032394    -0.84   0.401    -.0090704    .0036334
    mtrwrk14 |  -.0460753     .01741    -2.65   0.008     -.080213   -.0119376
    ftrwrk14 |   .0060289   .0422897     0.14   0.887    -.0768933     .088951
     numsibs |   .0052041   .0042107     1.24   0.217    -.0030523    .0134605
     bothpar |   .1085455   .0748325     1.45   0.147    -.0381869     .255278
     mtronly |    .043126   .0722479     0.60   0.551    -.0985386    .1847907
       _cons |   .8703592   .0880151     9.89   0.000     .6977779     1.04294
------------------------------------------------------------------------------

. * examine whether including tenure on the job along with experience
>   significantly alters the results;
. reg lnhrwg84 smkdly84 exp84 tenure84 south84 urban84 numkid84 marrd84
>         nonwhite female higrad84 afqt urban14 south mtreduc ftreduc mtrwrk14
>         ftrwrk14 numsibs bothpar mtronly if fullyr84 == 1 
>         [pweight=weight79], robust;
(sum of wgt is   9.1198e+06)

Regression with robust standard errors                 Number of obs =    2790
                                                       F( 20,  2769) =   36.35
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.2702
                                                       Root MSE      =  .36217

------------------------------------------------------------------------------
             |               Robust
    lnhrwg84 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    smkdly84 |  -.0345699   .0177462    -1.95   0.052    -.0693671    .0002273
       exp84 |   .0382544   .0057368     6.67   0.000     .0270055    .0495032
    tenure84 |   .0267526   .0055181     4.85   0.000     .0159325    .0375727
     south84 |  -.0299473   .0376951    -0.79   0.427    -.1038606     .043966
     urban84 |   .1217308   .0212755     5.72   0.000     .0800134    .1634483
    numkid84 |   .0054945   .0133801     0.41   0.681    -.0207415    .0317304
     marrd84 |   .0663368   .0190083     3.49   0.000     .0290649    .1036087
    nonwhite |   .0213617   .0247664     0.86   0.388    -.0272007     .069924
      female |  -.1747059   .0165632   -10.55   0.000    -.2071833   -.1422285
    higrad84 |   .0484164   .0058827     8.23   0.000     .0368815    .0599513
        afqt |   .0039423   .0006235     6.32   0.000     .0027197    .0051649
     urban14 |   .0320704    .020894     1.53   0.125    -.0088989    .0730397
       south |   .0044677   .0388431     0.12   0.908    -.0716967    .0806322
     mtreduc |   .0008966   .0039246     0.23   0.819    -.0067988    .0085919
     ftreduc |  -.0016195   .0032716    -0.50   0.621    -.0080345    .0047955
    mtrwrk14 |   -.042754   .0173638    -2.46   0.014    -.0768014   -.0087067
    ftrwrk14 |   .0035801   .0425181     0.08   0.933    -.0797903    .0869505
     numsibs |   .0047344   .0041906     1.13   0.259    -.0034827    .0129515
     bothpar |   .1094394   .0739523     1.48   0.139    -.0355678    .2544465
     mtronly |   .0586035   .0721505     0.81   0.417    -.0828707    .2000776
       _cons |    .827434     .08853     9.35   0.000     .6538425    1.001025
------------------------------------------------------------------------------

. * examine whether the returns to experience is affected by whether or not
>   you smoke.  If smokers have a higher rate of time preference, then we
>   should expect the interaction term to be negative;
. gen smokexp = smkdly84*exp84;

. reg lnhrwg84 smkdly84 exp84 smokexp south84 urban84 numkid84 marrd84
>         nonwhite female higrad84 afqt urban14 south mtreduc ftreduc mtrwrk14
>         ftrwrk14 numsibs bothpar mtronly if fullyr84 == 1 
>         [pweight=weight79], robust;
(sum of wgt is   9.1926e+06)

Regression with robust standard errors                 Number of obs =    2817
                                                       F( 20,  2796) =   35.73
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.2594
                                                       Root MSE      =  .36438

------------------------------------------------------------------------------
             |               Robust
    lnhrwg84 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    smkdly84 |  -.1083835   .0485285    -2.23   0.026    -.2035388   -.0132282
       exp84 |    .047377   .0060112     7.88   0.000     .0355901    .0591638
     smokexp |   .0133826   .0094353     1.42   0.156    -.0051182    .0318833
     south84 |  -.0343979   .0371231    -0.93   0.354    -.1071895    .0383936
     urban84 |   .1170225   .0213297     5.49   0.000     .0751989     .158846
    numkid84 |   .0013842   .0135129     0.10   0.918     -.025112    .0278804
     marrd84 |    .073648   .0189261     3.89   0.000     .0365374    .1107586
    nonwhite |   .0299452   .0247289     1.21   0.226    -.0185435    .0784339
      female |  -.1705491   .0165426   -10.31   0.000    -.2029859   -.1381122
    higrad84 |   .0446649    .005823     7.67   0.000      .033247    .0560828
        afqt |   .0039754   .0006205     6.41   0.000     .0027588    .0051921
     urban14 |   .0287601   .0209007     1.38   0.169    -.0122223    .0697424
       south |   .0076426   .0382616     0.20   0.842    -.0673812    .0826664
     mtreduc |   .0018889   .0039707     0.48   0.634    -.0058969    .0096747
     ftreduc |  -.0026678   .0032491    -0.82   0.412    -.0090386     .003703
    mtrwrk14 |  -.0461409   .0174239    -2.65   0.008    -.0803059   -.0119758
    ftrwrk14 |   .0067554   .0422886     0.16   0.873    -.0761646    .0896754
     numsibs |   .0049747   .0042214     1.18   0.239    -.0033026    .0132521
     bothpar |   .1095204   .0748823     1.46   0.144    -.0373098    .2563506
     mtronly |   .0473359   .0723107     0.65   0.513    -.0944517    .1891236
       _cons |   .8946311   .0891961    10.03   0.000     .7197343    1.069528
------------------------------------------------------------------------------

. log close;
       log:  C:\My Documents\ECON 20\smoke1regs.log
  log type:  text
 closed on:  28 Aug 2002, 16:22:59
--------------------------------------------------------------------------------------------------
